Revit 2027 API
UpdaterRegistry.GetRegisteredUpdaterInfos(Document) Method
 Returns information about all updaters applicable to the given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<UpdaterInfo> GetRegisteredUpdaterInfos(
	Document document
)
Public Shared Function GetRegisteredUpdaterInfos (
	document As Document
) As IList(Of UpdaterInfo)
public:
static IList<UpdaterInfo^>^ GetRegisteredUpdaterInfos(
	Document^ document
)
static member GetRegisteredUpdaterInfos :
        document : Document -> IList<UpdaterInfo>
Parameters
document Document
 The document to which sought updaters are applicable to.
Return Value
IList<UpdaterInfo>
 List of UpdaterInfo structures
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The list of data includes information about all updaters explicitly registered for the document as well as information about all application-wide registered updaters (which are applicable to all documents).
See Also
Reference
UpdaterRegistry Class
GetRegisteredUpdaterInfos Overload
Autodesk.Revit.DB Namespace